In [1]:
import numpy as np # linear algebra
import pandas as pd # data processing, CSV file I/O (e.g. pd.read_csv)

In [3]:
df = pd.DataFrame([[np.nan, 2, np.nan, 0], [3, 4, np.nan, 1], [np.nan, np.nan, np.nan, 5],[3, 4, np.nan, 1], [3, 4, 0, 1]], columns=list('ABCD'))

In [4]:
df.shape

(5, 4)

In [5]:
df

     A    B    C  D
0  NaN  2.0  NaN  0
1  3.0  4.0  NaN  1
2  NaN  NaN  NaN  5
3  3.0  4.0  NaN  1
4  3.0  4.0  0.0  1

In [7]:
df.drop_duplicates() #It will remove index 3 since it is dublicate to 1

     A    B    C  D
0  NaN  2.0  NaN  0
1  3.0  4.0  NaN  1
2  NaN  NaN  NaN  5
4  3.0  4.0  0.0  1

In [8]:
df.dropna?

In [9]:
df.dropna(axis=1, how='all') #remve all column where all value is 'NaN' exists

     A    B    C  D
0  NaN  2.0  NaN  0
1  3.0  4.0  NaN  1
2  NaN  NaN  NaN  5
3  3.0  4.0  NaN  1
4  3.0  4.0  0.0  1

In [10]:
df.dropna(axis=0, how='all') #remve all row where all value is 'NaN' exists

     A    B    C  D
0  NaN  2.0  NaN  0
1  3.0  4.0  NaN  1
2  NaN  NaN  NaN  5
3  3.0  4.0  NaN  1
4  3.0  4.0  0.0  1

In [11]:
df.dropna(axis=1, how='any') #remve all column where any value is 'NaN' exists

   D
0  0
1  1
2  5
3  1
4  1

In [12]:
df.dropna(axis=0, how='any') #remve all column where all value is 'NaN' exists

     A    B    C  D
4  3.0  4.0  0.0  1

In [13]:
df.dropna(thresh=2) #remve all row if there is non-'NaN' value is less than 2

     A    B    C  D
0  NaN  2.0  NaN  0
1  3.0  4.0  NaN  1
3  3.0  4.0  NaN  1
4  3.0  4.0  0.0  1

In [15]:
df

     A    B    C  D
0  NaN  2.0  NaN  0
1  3.0  4.0  NaN  1
2  NaN  NaN  NaN  5
3  3.0  4.0  NaN  1
4  3.0  4.0  0.0  1

In [14]:
df.dropna(axis=1, thresh=2) #remve all column if there is non-'NaN' value is less than 2

     A    B  D
0  NaN  2.0  0
1  3.0  4.0  1
2  NaN  NaN  5
3  3.0  4.0  1
4  3.0  4.0  1

In [17]:
df

     A    B    C  D
0  NaN  2.0  NaN  0
1  3.0  4.0  NaN  1
2  NaN  NaN  NaN  5
3  3.0  4.0  NaN  1
4  3.0  4.0  0.0  1

In [16]:
df.dropna(axis=0, subset=['A']) #remove row where if there is any 'NaN' value in column 'A'

     A    B    C  D
1  3.0  4.0  NaN  1
3  3.0  4.0  NaN  1
4  3.0  4.0  0.0  1

In [19]:
df

     A    B    C  D
0  NaN  2.0  NaN  0
1  3.0  4.0  NaN  1
2  NaN  NaN  NaN  5
3  3.0  4.0  NaN  1
4  3.0  4.0  0.0  1

In [18]:
df.dropna(axis=1, subset=[1]) #remove column  if there is any 'NaN' value in index is '1'

     A    B  D
0  NaN  2.0  0
1  3.0  4.0  1
2  NaN  NaN  5
3  3.0  4.0  1
4  3.0  4.0  1